---
kind: property
id: P:Autodesk.Revit.DB.Electrical.TemperatureRatingType.Name
source: html/35bbef58-e76c-35bf-b2e2-1ccd3e99f1e1.htm
---
# Autodesk.Revit.DB.Electrical.TemperatureRatingType.Name Property

Get name of temperature rating type.

## Syntax (C#)
```csharp
public override string Name { set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Set name can't be supported.